extends Node



var LevelsInfo:={
	1:["Первая встреча",[ ["Monolog",11],["Monolog",12],["Connector",1],["Monolog",13],["Connector",2],["Monolog",13],["Connector",3],["Monolog",13],["Connector",4],["Monolog",13],["Connector",5],["Monolog",13] ]],
	2:[],
	3:[],
	4:[],
	5:[],
	6:[],
	7:[],
	8:[],
	9:[],
	10:[],
	11:[],
	12:[],
	13:[],
	14:[],
	15:[],
	16:[],
	17:[],
	18:[],
	19:[],
	20:[],
}



var SegmentsInfo:={
	"Monolog":{ #Images name + Text + Answer Test
		"preload":preload("res://Scenes/Segments/Monolog.tscn"),
		11:["Hi","Привет! Я Буквик\nЯ прилетел изучать вашу замечательную планету","Привет!"],
		12:["Happy","Для начала мне нужно научиться читать!\nПоможешь мне?","Конечно!"],
		13:["Happy","Как хорошо, что я тебя встретил!\nТы такой умный!","Давай еще!"],
	},
	"Connector":{ #Images name + Text
		"preload":preload("res://Scenes/Segments/Connector.tscn"),
		1:["БАНТ","БЫК","ФЕН","ФЛАГ","ГНОМ","ГРИБ","ЛАК","ДОЧЬ","ЛЕВ","ЛИСТ"],
		2:["НОС","РИС","РЫСЬ","СЛОН","ЛУК","СЫР","ШАР","ТОРТ","ВОЛК","ВРАЧ"],
		3:["ЧАЙ","КИТ","ЛОСЬ","СЫН","СОМ","ДОМ","КЛЮЧ","СОК","МЫШЬ","СТУЛ"],
		4:["КРОТ","ДВЕРЬ","ДУШ","ДУБ","КОТ","КРАН","МЯЧ","МЕЧ","СТОЛ","СУП"],
		5:["КОНФЕТА","МАШИНА","СОБАКА","ГОЛОВА","КАША","КУБИКИ","МАЛИНА","РАДУГА","РАКЕТА","РЫБА"],
	}
	
}


var CollectionsInfo:={
	"Семья":["ДОЧЬ"],
	"Волшебство":["ГНОМ"],
	"Животные":["БЫК","ЛЕВ","РЫСЬ","СЛОН"],
	"Одежда":["БАНТ"],
	"Растения":["ГРИБ","ЛИСТ"],
	"Техника":["ФЕН"],
	"Еда":["РИС"],
}


var Words:={ #[img, slogs map,unlocked?]
"БАНТ":["bant",[4],false],
"БЫК":["byk",[3],false],
"ФЕН":["fen",[3],false],
"ФЛАГ":["flag",[4],false],
"ГНОМ":["gnom",[4],false],
"ГРИБ":["grib",[4],false],
"ЛАК":["lak",[3],false],
"ДОЧЬ":["docz",[4],false],
"ЛЕВ":["lev",[3],false],
"ЛИСТ":["list",[4],false],
"НОС":["nos",[3],false],
"РИС":["ris",[3],false],
"РЫСЬ":["rys",[4],false],
"СЛОН":["slon",[4],false],
"ЛУК":["luk",[3],false],
"СЫР":["syr",[3],false],
"ШАР":["szar",[],false],
"ТОРТ":["tort",[],false],
"ВОЛК":["volk",[],false],
"ВРАЧ":["vracz",[],false],
"ЧАЙ":["czaj",[],false],
"КИТ":["kit",[],false],
"ЛОСЬ":["los",[],false],
"СЫН":["syn",[],false],
"СОМ":["som",[],false],
"ДОМ":["dom",[],false],
"КЛЮЧ":["klucz",[],false],
"СОК":["sok",[],false],
"МЫШЬ":["mysz",[],false],
"СТУЛ":["stul",[],false],
"КРОТ":["krot",[],false],
"ДВЕРЬ":["dver",[],false],
"ДУШ":["dusz",[],false],
"ДУБ":["dub",[],false],
"КОТ":["kot",[],false],
"КРАН":["kran",[],false],
"МЯЧ":["miacz",[],false],
"МЕЧ":["mecz",[],false],
"СТОЛ":["stol",[],false],
"СУП":["sup",[],false],
"КОНФЕТА":["candy",[3,2,2],false],
"МАШИНА":["car",[2,2,2],false],
"СОБАКА":["dog",[2,2,2],false],
"ГОЛОВА":["head",[2,2,2],false],
"КАША":["kasza",[2,2],false],
"КУБИКИ":["kubiki",[2,2,2],false],
"МАЛИНА":["malina",[2,2,2],false],
"РАДУГА":["rainbow",[2,2,2],false],
"РАКЕТА":["raketa",[2,2,2],false],
"РЫБА":["ryba",[2,2],false],
}
