extends Node

var DEVMODE:=true #true/false

var LevelsInfo:={ #
	1:["Первая встреча",[ ["Monolog",11],["Monolog",12],["Connector",0],["Monolog",14],["Monolog",15],["Puzzle",0],["Monolog",10],["Monolog",16],["TransitionPuzzle",0],["Monolog",13],["Monolog",18],["Repairing",0],["MemoryCards",0],["Monolog",19],["MemoryCards",1], ["Monolog",17] ]],
	2:["Эксперименты",  [["Monolog",20],["Monolog",21],["Connector",1],["Monolog",22],["Monolog",23],["Puzzle",1],["Monolog",24],["Monolog",25],["TransitionPuzzle",1],["Monolog",26],["Repairing",1],["MemoryCards",2],["Monolog",27],["Quiz",0],  ["Monolog",28] ]],
	3:["Фокусы с буквами",[["Monolog",30],["Monolog",31],["Notesy",0],["Monolog",32],["Quiz",1],["Monolog",33],["Repairing",2],["Monolog",34],["TransitionPuzzle",2],["MemoryCards",3],["Monolog",35],["Puzzle",2],["Monolog",36],["Monolog",37] ]],
	4:["Любимые игрушки",[["Monolog",40],["Monolog",41],["Puzzle",3],["Monolog",42],["MemoryCards",4],["Monolog",43],["Monolog",44],["TransitionPuzzle",3],["Monolog",45],["Connector",2],["Monolog",46],["Repairing",3],["Monolog",47],["Notesy",1],["Monolog",48]]],
	5:["Великий художник",[["Monolog",50],["Monolog",51],["Connector",3],["Monolog",52],["Notesy",2],["Monolog",53],["Quiz",2],["Monolog",54],["MemoryCards",5],["Monolog",55],["Repairing",4],["Monolog",56]]],
	6:["Первая репетиция",[["Monolog",60],["Monolog",61],["Puzzle",4]       ]],
	7:[],
	8:[],
	9:[],
	10:[],
	11:[],
	12:[],
}



var SegmentsInfo:={
	"Monolog":{ #Images name + Text + Answer Test
		"preload":preload("res://Scenes/Segments/Monolog.tscn"),
		11:["Hi","Привет! Я Буквик\nЯ прилетел изучать вашу планету","Привет!"],
		12:["Happy","Для начала мне нужно научиться читать!\nПоможешь мне?","Конечно!"],
		13:["Happy","Это был я на своей родной планете!\nУзнал меня?","Конечно!"],
		14:["Read","Все слова я собираю в эту книжку\nДать посмотреть?","Давай"],
		15:["BookDrop","Ой, уронил!\nТеперь надо все собрать","(помочь Буквику)"],
		16:["Hi","А теперь давай передохнём\nГотов собрать пазл?","Готов!"],
		18:["Fly","И сейчас мы туда полетииим\nПодключай провода!","Вперёд!"],
		10:["Happy","У тебя отлично получается!\nКак хорошо, что я тебя встретил","Спасибо!"],
		19:["Mage","Ух ты, получилось!\nА справишься с заданием посложнее?","Легко!"],
		17:["Happy","Спасибо за помощь!\n Увидимся на следующем занятии","Выход"],
		
		20:["Happy","Как я рад тебя снова видеть!","Привет!"],
		21:["Сhemical","В моей книжке появились новые слова\nПосмотришь?","Показывай!"],
		22:["Сhemical","Какой ты умный!\nКак хорошо, что у меня такой помощник","Спасибо"],
		23:["Boom2","Ой, я что-то нахимичил в опытах\nТеперь нужно собрать все обратно","Сейчас соберу"],
		24:["Happy","Какой ты молодец!\nТы спас наш эксперимент","Ура!"],
		25:["Fly","Ой, посмотри, кто там летает!","(посмотреть наверх)"],
		26:["Сhemical","Это я проводил опыт по отправлению\nсвоих друзей в космос","Давай и мы полетим"],
		27:["Think","Ого, тебя сегодня не остановить...\nА сможешь разгадать мою загадку? ","Давай попробую"],
		28:["Happy","У тебя получилось!\nНа следующем занятии придумаю что-нибудь посложнее","Выход"],
	
		30:["Hi","Привет!\nКак хорошо, что ты вернулся!","Привет!"],
		31:["Focus","Сегодня мы будем учиться магии.\nСможешь разгадать мой первый фокус?","Я готов!"],
		32:["Happy","Как здорово у тебя получается!\nА сможешь разгадать тайное заклинание? ","Смогу!"],
		33:["Fly","Правильно!\nА теперь подключай ракету и посмотрим,\nработают ли мои фокусы в космосе.","Давай"],
		34:["Plate","Ух ты, смотри, настоящая магия в космосе!","Посмотреть поближе"],
		35:["Cry","Ой, я что-то наколдовал и слова в моей книжке перепутались..\nПоможешь их собрать?","Я соберу"],
		36:["Happy","Ура, ты справился!\nТы тоже настоящий волшебник!","Спасибо"],
		37:["Card","Сегодня мы побывали в мире магии.\nА в следующий раз отправимся в мир игрушек!","Увидимся"],
		
		
		40:["Hi","Привет-привет!\nА я уже соскучился по тебе!","Привет!"],
		41:["Toy","Давай поиграем вместе!\nСможешь узнать все мои любимые игрушки?","Смогу"],
		42:["Happy","Ух ты! Как весело с тобой играть!","Спасибо"],
		43:["ToyHappy","Просто класс!\nКак здорово у тебя получается!","Давай ещё"],
		44:["Think","Я обожаю собирать пазлы!","Давай вместе"],
		45:["BookDrop","Ой, я так веселился, что уронил книгу...","(помочь Буквику)"],
		46:["Fly","Я обожаю летать.\nМожет, подключим ракету и отправимся в космос?","Вперёд!"],
		47:["Plate","Только в космосе все буквы разлетелись.\nСможешь их собрать?","Собрать слово"],
		48:["Sleep","Ой, с тобой очень круто!\nЯ так наигрался и засыпаю. Продолжим в следующий раз?","До встречи!"],
		
		50:["Happy","Привеееет!\nКак я рад тебя снова видеть!","Привет!"],
		51:["Artist","Я решил стать великим художником.\nПоможешь мне научиться рисовать то, что есть на твоей планете?","Конечно!"],
		52:["Think","Так, я начинаю запоминать ваши слова.\nСейчас нарисую ещё парочку. Поможешь мне?","Без проблем"],
		53:["Brush","Ура! У меня начинает получаться очень похоже!\nСможешь прочитать загадку и отгадать, что я нарисовал?","Легко!"],
		54:["Happy","А сможешь запомнить все мои рисунки?","Запомню!"],
		55:["Fly","Я бы очень хотел показать рисунки своим друзьям в космосе!\nПоможешь мне подключить летающую тарелку?","Помогу!"],
		56:["ArtistDop","Получилось!\nЯ стал первым художником в космосе. Увидимся!","Ура, до встречи!"],
	
		60:["Music","Привет!\nМне снился сон, что я стал знаменитым музыкантом…\nя хочу попробовать! Поможешь мне?","Привет! Конечно!"],
		61:["Think","Как эти штуки называются?\nЕсли я запомню музыкальные слова, смогу играть лучше!","Давай запомним!"],
		62:["Music","У меня тут космический усилитель!\nЧтобы репетировать - нужно подключить всё правильно","Привет! Конечно!"],
		
	},
	"Connector":{ #Images name + Text
		"preload":"res://Scenes/Segments/Connector.tscn",
		0:["ВРАЧ","РЫСЬ","ФЛАГ","ДОМ","ЧАЙ","ЛУК","ГРИБ","ТОРТ","ДВЕРЬ","МЫШЬ"],
		1:["СТУЛ","НОС","МЯЧ","КОТ","ЛИСТ","СОМ","СУП","КРАН","ФЕН","СОК"],
		#-не использовали V
		2:["РЫБА","ШАР","ВОЛК","КАША","ЛОСЬ","БЫК","ЦВЕТОК","КРОТ","СТОЛ","СЫР"],
		3:["РИС","АРБУЗ","ЁЖИК","ЧАСЫ","БУКЕТ","ГРУША","ГОРКА","КАМИН","ДУБ","КУКЛА"],
		4:["ЛЕВ","ЛАПА","ЗУБ","КОШКА","БАНТ","ЯЩИК","ЛОШАДЬ","ДОКТОР","ЛУНА","ДИВАН"],
		5:["БУСЫ","КИТ","КУРТКА","АНГЕЛ","ОСА","ПАКЕТ","ЛАК","ЛИМОН","МАМА","ОЛЕНЬ"],
		6:["МАСКА","ПЛАТЬЕ","РЮКЗАК","МЕШОК","ОСЁЛ","ПОЛКА","ГНОМ","КЛЮЧ","ПИЛОТ","МЕЧ"],
		7:["СЫН","ПИСЬМО","ШАПКА","СКРИПКА","СОВА","ДУШ","НОСОК","ЩЁТКА","ВЕНОК","ТУЧА"],
		8:["СУНДУК","ПИРАТ","КЕПКА","ВОЛНА","СНЕГИРЬ","КНИГА","ЩЕНОК","ЗАБОР","ШИШКА","ЛОДКА"],
		9:["УТЮГ","СВИТЕР","ШОРТЫ","МАЛИНА","ЛАМПА","ЗАМОК","РОБОТ","КУБИКИ","ВАЗА","ПАПА"],
		10:["ЗВЕЗДА","ОКНО","СЛОН","ТЕТРАДЬ","ЮБКА","ЖАБА","ШАРФИК","СОБАКА","ДОЧЬ","ЗОНТИК"],
		11:["РАКЕТА","ГОЛОВА","МАШИНА","ЖЕЛЕ","ЕНОТ","КОНФЕТА","ЗЕФИР","ПЕНАЛ","РАДУГА","ВИШНЯ"],
	},
	"Puzzle":{ #Images name + Text
		"preload":"res://Scenes/Segments/Puzzle.tscn",
		0:["СУНДУК","ПИРАТ","ТУЧА","ВОЛНА","ЗАМОК","КНИГА"],
		1:["ЛАМПА","ЧАСЫ","ПЕНАЛ","РОБОТ","ТЕТРАДЬ","АРБУЗ"],
		2:["ПИЛОТ","РЮКЗАК","МАСКА","НОСОК","ЗАБОР","ДИВАН"],
		3:["ГОРКА","КУКЛА","РОБОТ","РАКЕТА","МАШИНА","СУНДУК"],
		4:["ЗВЕЗДА","МУЗЫКАНТ","БАРАБАН","ТЕТРАДЬ","СКРИПКА","МАСКА"],
	},
	"Repairing":{ #Images name + Text
		"preload":"res://Scenes/Segments/Repairing.tscn",
		0:["РАКЕТА","ГОЛОВА","МАШИНА","КОНФЕТА","ЗАБОР"],
		1:["ЗЕФИР","МАЛИНА","СОБАКА","РАДУГА","ЖАБА"],
		2:["СОВА","ОЛЕНЬ","ПАКЕТ","ЛОДКА","КНИГА"],
		3:["КУБИКИ","ЛОШАДЬ","ДОКТОР","СОБАКА","АНГЕЛ"],
		4:["УЛИТКА","РИСУНОК","ВИШНЯ","ПОДАРОК","КУКЛА"],
	},
	"Quiz":{ #Images name + Text
		"preload":"res://Scenes/Segments/Quiz.tscn",
		0:[["ГРОМ-КО   КАШ-ЛЯ-ЕТ   СЕ-РЁ-ЖА.\nУ   НЕ-ГО   БРОН-ХИТ,   ПО-ХО-ЖЕ.\nВ   ПО-ЛИК-ЛИ-НИ-КУ   ЗВО-НЯТ,\nА   СЕ-РЁ-ЖЕ   ГО-ВО-РЯТ:\n— ТЫ   НЕ   БОЙ-СЯ  И   НЕ   ПЛАЧЬ –\nК   ТЕ-БЕ   Е-ДЕТ   ДОБ-РЫЙ…",\
		["МЯЧ","ВРАЧ","ГНОМ"],1]],
		1:[["В  НЁМ   У-ЧЕБ-НИ-КИ  И  КРАС-КИ,\nИН-ТЕ-РЕС-НЕЙ-ШИ-Е   СКАЗ-КИ,\nНУ  А  ЕС-ЛИ   У-МУД-РИТЬ-СЯ,\nМО-ЖЕТ   ФОР-МА   ПО-МЕС-ТИТЬ-СЯ.",\
		["РЮКЗАК","ПЕНАЛ","ЯЩИК"],0]],
		2:[["В   ШО-КО-ЛАД-КУ   СПРЯ-ТА-НА   ВКУС-НА-Я   НА-ЧИН-КА.\nФАН-ТИК   ПРИВ-ЛЕ-КА-ТЕЛЬ-НЫЙ,   ЯР-КА-Я   КАР-ТИН-КА!\nСКУ-ШАТЬ   СРА-ЗУ   ХО-ЧЕТ-СЯ   БОЛЬ-ШЕ   КИ-ЛОГ-РАМ-МА.\nНО   ДА-ЁТ   ПОШ-ТУЧ-НО   НАМ   Э-ТУ   СЛА-ДОСТЬ   МА-МА.\nОТ-ГА-ДАЙ,   НУ   ЧТО   ЖЕ   Э-ТО?\nО-ЧЕНЬ   ВКУС-НА-Я...",\
		["РАКЕТА","ЛИМОН","КОНФЕТА"],2]],
		
	},
	
	"TransitionPuzzle":{ #Images name + Text
		"preload":"res://Scenes/Segments/TransitionPuzzle.tscn",
		0:["res://Assets/Images/Illustrations/Motherhood.jpg",Vector2(2,4)],
		1:["res://Assets/Images/Illustrations/Cosmo.jpg",Vector2(2,3)],
		2:["res://Assets/Images/Illustrations/Focus.jpg",Vector2(2,5)],
		3:["res://Assets/Images/Illustrations/Toy.jpg",Vector2(2,5)],
	},
	
	"MemoryCards":{ #Images name + Text
		"preload":"res://Scenes/Segments/MemoryCards.tscn",
		0:[Vector2(2,2),0.0,["", "А пока летим,\nдавай рассматривать звезды!"],"Mage"], #grid size and difficilty
		1:[Vector2(4,2),0.05,[],"Mage"], #grid size and difficilty
		2:[Vector2(4,3),0.0,["", "Смотри, сколько сегодня звезд на небе!"],"Mage"],
		3:[Vector2(4,3),0.0,["", "А сможешь разгадать фокус с картами?"],"Mage"],
		4:[Vector2(4,2),0.05,["", "А запомнишь все карточки, что я нарисовал?\n"],"Paint"],
		5:[Vector2(4,3),0.05,["", "А запомнишь все карточки, что я нарисовал?\n"],"Paint"],
	},
	"Notesy":{ #Images name + Text
		"preload":"res://Scenes/Segments/Notesy.tscn",
		0:[Vector2(2,2),["ВРАЧ","ГОЛОВА","ВОЛК","КОШКА"],["Focus", "Я заколдовал все слова,     \nсможешь найти правильные?      "]],
		 1:[Vector2(2,2),["ЗВЕЗДА","КЕПКА","ГРИБ","АРБУЗ"],["Focus", "Все слова перепутались,     \nсможешь найти правильные?      "]],
		2:[Vector2(2,2),["ЮБКА","СКРИПКА","ЩЕНОК","КОНФЕТА"],["Focus", "Все слова перепутались,     \nсможешь найти правильные?      "]],
	},
	
}


func _ready()->void:
	return
	print("WordsCheck")
	for i in Words:
		var _test=load("res://Assets/Images/Objects/"+(Words[i][0])+".png")
	
	return
	#create Conncetor levels
	var keys:Array=Words.keys()
	var _words_count:int=keys.size()
	var _f_array:Array
	
	for i in (_words_count-25):
		var _randi:int=randi()%25
		_f_array.append( keys[_randi] )
		keys.remove_at(_randi)
	keys.shuffle()
	_f_array.append_array(keys)
	
	for level_n in _words_count/10:
		var _text:=str(level_n)+":["
		for i in 10:
			_text+=_f_array[i+level_n*10]+","
		_text+="],"
		print(_text)

	
	


#var CollectionsInfo:={
	#"Семья":["ДОЧЬ"],
	#"Волшебство":["ГНОМ"],
	#"Животные":["БЫК","ЛЕВ","РЫСЬ","СЛОН"],
	#"Одежда":["БАНТ"],
	#"Растения":["ГРИБ","ЛИСТ"],
	#"Техника":["ФЕН"],
	#"Еда":["РИС"],
#}


var Words:={ #[img, slogs map,unlocked?]
#one
"БАНТ":["bant",[4],false],
"БЫК":["byk",[3],false],
"ФЕН":["fen",[3],false],
"ФЛАГ":["flag",[4],false],
"ГНОМ":["gnom",[4],false],
"ГРИБ":["grib",[4],false],
"ЛАК":["lak",[3],false],
"ДОЧЬ":["docz",[4],false],
"ЛЕВ":["lev",[3],false],
"ЛИСТ":["list",[4],false],
"НОС":["nos",[3],false],
"РИС":["ris",[3],false],
"РЫСЬ":["rys",[4],false],
"СЛОН":["slon",[4],false],
"ЛУК":["luk",[3],false],
"СЫР":["syr",[3],false],
"ШАР":["szar",[3],false],
"ТОРТ":["tort",[4],false],
"ВОЛК":["volk",[4],false],
"ВРАЧ":["vracz",[4],false],
"ЧАЙ":["czaj",[3],false],
"КИТ":["kit",[3],false],
"ЛОСЬ":["los",[4],false],
"СЫН":["syn",[3],false],
"СОМ":["som",[3],false],
"ДОМ":["dom",[3],false],
"КЛЮЧ":["klucz",[4],false],
"СОК":["sok",[3],false],
"МЫШЬ":["mysz",[4],false],
"СТУЛ":["stul",[4],false],
"КРОТ":["krot",[4],false],
"ДВЕРЬ":["dver",[5],false],
"ДУШ":["dusz",[3],false],
"ДУБ":["dub",[3],false],
"КОТ":["kot",[3],false],
"КРАН":["kran",[4],false],
"МЯЧ":["miacz",[3],false],
"МЕЧ":["mecz",[3],false],
"СТОЛ":["stol",[4],false],
"СУП":["sup",[3],false],
"ЗУБ":["zub",[3],false],


#two
"КАША":["kasza",[2,2],false],
"РЫБА":["ryba",[2,2],false],

"АНГЕЛ":["angel",[2,3],false],
"АРБУЗ":["arbuz",[2,3],false],
"БУКЕТ":["buket",[2,3],false],
"БУСЫ":["busy",[2,2],false],
"ЦВЕТОК":["cvetok",[3,3],false],
"ЧАСЫ":["czasy",[2,2],false],
"ДИВАН":["divan",[2,3],false],
"ДОКТОР":["doktor",[3,3],false],
"ЕНОТ":["enot",[1,3],false],
"ЁЖИК":["ezik",[1,3],false],
"ГОРКА":["gorka",[3,2],false],
"ГРУША":["grusza",[3,2],false],
"ЯЩИК":["jaszczik",[1,3],false],
"ЮБКА":["jubka",[2,2],false],
"КАМИН":["kamin",[2,3],false],
"КЕПКА":["kepka",[3,2],false],
"КНИГА":["kniga",[3,2],false],
"КОШКА":["koszka",[3,2],false],
"КУКЛА":["kukla",[3,2],false],
"КУРТКА":["kurtka",[4,2],false],
"ЛАМПА":["lampa",[3,2],false],
"ЛАПА":["lapa",[2,2],false],
"ЛИМОН":["limon",[2,3],false],
"ЛОДКА":["lodka",[3,2],false],
"ЛОШАДЬ":["loszad",[2,4],false],
"ЛУНА":["luna",[2,2],false],
"МАМА":["mama",[2,2],false],
"МАСКА":["maska",[3,2],false],
"МЕШОК":["meszok",[2,3],false],
"НОСОК":["nosok",[2,3],false],
"ОКНО":["okno",[2,2],false],
"ОЛЕНЬ":["olen",[2,4],false],
"ОСА":["osa",[1,2],false],
"ОСЁЛ":["osel",[1,3],false],
"ПАКЕТ":["paket",[2,3],false],
"ПАПА":["papa",[2,2],false],
"ПЕНАЛ":["penal",[2,3],false],
"ПИЛОТ":["pilot",[2,3],false],
"ПИРАТ":["pirat",[2,3],false],
"ПИСЬМО":["pismo",[4,2],false],
"ПЛАТЬЕ":["platie",[3,3],false],
"ПОЛКА":["polka",[3,2],false],
"РОБОТ":["robot",[2,3],false],
"РЮКЗАК":["rukzak",[3,3],false],
"СКРИПКА":["skripka",[5,2],false],
"СНЕГИРЬ":["snegir",[3,4],false],
"СОВА":["sova",[2,2],false],
"СУНДУК":["sunduk",[3,3],false],
"СВИТЕР":["sviter",[3,3],false],
"ШАПКА":["szapka",[3,2],false],
"ШАРФИК":["szarfik",[3,3],false],
"ЩЕНОК":["szczenok",[2,3],false],
"ЩЁТКА":["szczetka",[3,2],false],
"ШИШКА":["sziszka",[3,2],false],
"ШОРТЫ":["szorty",[3,2],false],
"ТЕТРАДЬ":["tetrad",[3,4],false],
"ТУЧА":["tucza",[2,2],false],
"УТЮГ":["utug",[1,3],false],
"ВАЗА":["vaza",[2,2],false],
"ВЕНОК":["venok",[2,3],false],
"ВИШНЯ":["visznia",[3,2],false],
"ВОЛНА":["volna",[3,2],false],
"ЖАБА":["zaba",[2,2],false],
"ЗАБОР":["zabor",[2,3],false],
"ЗАМОК":["zamok",[2,3],false],
"ЗЕФИР":["zefir",[2,3],false],
"ЖЕЛЕ":["zele",[2,2],false],
"ЗОНТИК":["zontik",[3,3],false],
"ЗВЕЗДА":["zvezda",[4,2],false],

#three
"КУБИКИ":["kubiki",[2,2,2],false],
"МАЛИНА":["malina",[2,2,2],false],
"РАДУГА":["rainbow",[2,2,2],false],
"РАКЕТА":["raketa",[2,2,2],false],
"КОНФЕТА":["candy",[3,2,2],false],
"МАШИНА":["car",[2,2,2],false],
"СОБАКА":["dog",[2,2,2],false],
"ГОЛОВА":["head",[2,2,2],false],

"АКУЛА":["akula",[1,2,2],false],
"АНАНАС":["ananas",[1,2,3],false],
"АПЕЛЬСИН":["apelsin",[1,4,3],false],
"АВТОБУС":["avtobus",[2,2,3],false],
"БАБОЧКА":["baboczka",[2,3,2],false],
"БАБУШКА":["babuszka",[2,3,2],false],
"БАРАБАН":["baraban",[2,2,3],false],
"БЕГЕМОТ":["begemot",[2,2,3],false],
"БЕЛОЧКА":["belka",[2,3,2],false],
"БОРОДА":["boroda",[2,2,2],false],
"ЦЫПЛЁНОК":["ciplenok",[3,2,3],false],
"КОРОНА":["crown",[2,2,2],false],
"ДЕДУШКА":["deduszka",[2,3,2],false],
"ДЕРЕВО":["derevo",[2,2,2],false],
"ФУТБОЛИСТ":["futbolist",[3,2,4],false],
"ГИРЛЯНДА":["girlianda",[3,3,2],false],
"ГОРОШЕК":["goroch",[2,2,3],false],
"ХУДОЖНИК":["hudoznik",[2,3,3],false],
"ИГРУШКИ":["igruszki",[2,3,2],false],
"ЯБЛОКО":["jabloko",[2,2,2],false],
"ЯГОДЫ":["jagody",[1,2,2],false],
"КАЧЕЛИ":["kaczeli",[2,2,2],false],
"КАПУСТА":["kapusta",[2,3,2],false],
"КАРАНДАШ":["karandasz",[2,3,3],false],
"КАРЕТА":["kareta",[2,2,2],false],
"КАРТОШКА":["kartoszka",[3,3,2],false],
"КЕНГУРУ":["kenguru",[3,2,2],false],
"КЛУБНИКА":["klubnika",[4,2,2],false],
"КОРОВА":["korowa",[2,2,2],false],
"КУКУРУЗА":["kukuruza",[2,2,2,2],false],
"ЛАСТОЧКА":["lastoczka",[3,3,2],false],
"ЛЯГУШКА":["liaguszka",[2,3,2],false],
"ЛОПАТА":["lopata",[2,2,2],false],
"МАТРЁШКА":["matreszka",[3,3,2],false],
"МЕДУЗА":["meduza",[2,2,2],false],
"МЕЛЬНИЦА":["melnica",[4,2,2],false],
"МОЛОКО":["moloko",[2,2,2],false],
"МОНЕТА":["moneta",[2,2,2],false],
"МУЗЫКАНТ":["muzykant",[2,2,4],false],
"ОБЕЗЬЯНА":["obeziana",[1,4,1,2],false],
"ОВОЩИ":["ovoszczi",[1,2,2],false],
"ПЕЧЕНЬЕ":["peczenie",[2,4,1],false],
"ПЕРЧАТКИ":["perczatki",[3,3,2],false],
"ПОДУШКА":["pillow",[2,3,2],false],
"ПИЖАМА":["pizama",[2,2,2],false],
"ПОДАРОК":["podarok",[2,2,3],false],
"ПОЛОТЕНЦЕ":["polotence",[2,2,3,2],false],
"ПОМАДА":["pomada",[2,2,2],false],
"ПОСУДА":["posuda",[2,2,2],false],
"ПУГАЛО":["pugalo",[2,2,2],false],
"РЕДИСКА":["rediska",[2,3,2],false],
"РИСУНОК":["risunok",[2,2,3],false],
"РОМАШКА":["romaszka",[2,3,2],false],
"РУБАШКА":["rubaszka",[2,3,2],false],
"САМОЛЁТ":["samolet",[2,2,3],false],
"САПОГИ":["sapogi",[2,2,2],false],
"СНЕЖИНКА":["snezinka",[3,3,2],false],
"СОЛНЫШКО":["solnyszko",[3,3,2],false],
"СОРОКА":["soroka",[2,2,2],false],
"СТАКАН":["stakan",[3,3],false],
"ТАПОЧКИ":["tapoczki",[2,3,2],false],
"ТАРЕЛКА":["tarelka",[2,3,2],false],
"ТЕЛЕФОН":["telefon",[2,2,3],false],
"ТЕЛЕВИЗОР":["televizor",[2,2,2,3],false],
"УЛИТКА":["ulitka",[1,3,2],false],
"ВАРЕЖКА":["varezka",[2,3,2],false],
"ВЕЛОСИПЕД":["velosiped",[2,2,2,3],false],
"ВЕШАЛКА":["veszalka",[2,3,2],false],
"ЗЕРКАЛО":["zerkalo",[3,2,2],false],
}
